In [1]:
print("Hello world")

Hello world

In [1]:
with open('accounts.txt', mode= 'w') as accounts :
    accounts.write('100 Jones 24.98\n')
    accounts.write('200 Doe 345.67\n')
    accounts.write('300 White 0.00\n')
    accounts.write('400 Stone -42.16\n')
    accounts.write('500 Rich 224.62\n')

In [2]:
with open('accounts.txt', mode='r') as accounts:
    print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
    for record in accounts:
        account, name, balance = record.split()
        print(f'{account:<10}{name:<10}{balance:>10}')

Account   Name         Balance
100       Jones          24.98
200       Doe           345.67
300       White           0.00
400       Stone         -42.16
500       Rich          224.62

In [1]:
accounts = open('accounts.txt', 'r')

temp_file = open('temp_file.txt', 'w')

with accounts, temp_file:
    for record in accounts:
        account, name, balance = record.split()
        if account != '300':
            temp_file.write(record)
        else:
            new_record = ' '.join([account, 'Williams', balance])
            temp_file.write(new_record + '\n')

In [2]:
accounts_dict = {'accounts': [
    {'account': 100 , 'name': 'Jones', 'balance': 24.98},
    {'account': 200, 'name': 'Doe', 'balance': 345.67}]}

In [3]:
import json

with open('accounts.json', 'w') as accounts:
    json.dump(accounts_dict, accounts)

In [4]:
with open('accounts.json', 'r')as accounts:
    accounts_json = json.load(accounts)

In [5]:
accounts_json

{'accounts': [{'account': 100, 'name': 'Jones', 'balance': 24.98},
  {'account': 200, 'name': 'Doe', 'balance': 345.67}]}

In [6]:
accounts_json['accounts']

[{'account': 100, 'name': 'Jones', 'balance': 24.98},
 {'account': 200, 'name': 'Doe', 'balance': 345.67}]

In [8]:
accounts_json['accounts'][0]

{'account': 100, 'name': 'Jones', 'balance': 24.98}

In [9]:
accounts_json['accounts'][1]

{'account': 200, 'name': 'Doe', 'balance': 345.67}

In [12]:
with open('accounts.json', 'r') as accounts:
    print(json.dumps(json.load(accounts), indent=4))

{
    "accounts": [
        {
            "account": 100,
            "name": "Jones",
            "balance": 24.98
        },
        {
            "account": 200,
            "name": "Doe",
            "balance": 345.67
        }
    ]
}

{
    "accounts": [
        {
            "account": 100,
            "name": "Jones",
            "balance": 24.98
        },
        {
            "account": 200,
            "name": "Doe",
            "balance": 345.67
        }
    ]
}

{'accounts': [{'account': 100, 'name': 'Jones', 'balance': 24.98},
  {'account': 200, 'name': 'Doe', 'balance': 345.67}]}

In [13]:
try:
    print('try suite with no exceptions raised')
except:
    print('this will not execute')
else:
    print('else executes because no exceptions in the try suite')
finally:
        print('finally allways executes')

try suite with no exceptions raised
else executes because no exceptions in the try suite
finally allways executes

In [14]:
try:
    print('try suite that raises an exception')
    int('hello')
    print('this will not execute')
except ValueError:
    print('a ValueError occurrec')
else:
    print('else will not execute because an exception has occurred')
finally:
    print('finally always executes')

try suite that raises an exception
a ValueError occurrec
finally always executes

In [15]:
try:
    with open('gradez.txt', 'r') as accounts:
        print(f'{"ID"<3}{"Name":<7}{"Grade"}')
        for record in accounts:
            student_id, name, grade = record.split()
            print(f'{student_id:<3}{name:<7}{grade}')
except FileNotFoundError:
    print('The file name you specified does not exist')

The file name you specified does not exist

In [16]:
def function1():
    function2()

def function2():
    raise Exception('An exception occurred')

function1()

Exception: An exception occurred

9.12 Writing to a CSV File

In [17]:
import csv

with open('accounts.csv', mode='w', newline='') as accounts:
    writer = csv.writer(accounts)
    writer.writerow([100, 'Jones', 24.98])
    writer.writerow([200, 'Doe', 345.67])
    writer.writerow([300, 'White', 0.00])
    writer.writerow([400, 'Stone', -42.16])
    writer.writerow([500, 'Rich', 224.62])

In [20]:
with open('accounts.csv', 'r', newline='') as accounts:
    print(f'{"Accounts":<10}{"Name":<10}{"Balance":>10}')
    reader = csv.reader(accounts)
    for record in reader:
        account, name, balance = record
        print(f'{account:<10}{name:<10}{balance:>10}')

Accounts  Name         Balance
100       Jones          24.98
200       Doe           345.67
300       White            0.0
400       Stone         -42.16
500       Rich          224.62

In [24]:
import pandas as pd

df = pd.read_csv('accounts.csv',
                    names=['account', 'name', 'balance'])

df

   account   name  balance
0      100  Jones    24.98
1      200    Doe   345.67
2      300  White     0.00
3      400  Stone   -42.16
4      500   Rich   224.62

In [25]:
df.to_csv('accounts_from_dataframe.csv', index=False)

Titanic Dataset

In [27]:
import pandas as pd

titanic = pd.read_csv('https://vincentarelbundock.github.io/' +
    'Rdatasets/csv/carData/TitanicSurvival.csv')

In [30]:
pd.set_option('float_format', '{:.2f}'.format) # format for floating-point values

titanic.head()

                        Unnamed: 0 survived     sex   age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female 29.00            1st
1   Allison, Master. Hudson Trevor      yes    male  0.92            1st
2     Allison, Miss. Helen Loraine       no  female  2.00            1st
3  Allison, Mr. Hudson Joshua Crei       no    male 30.00            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female 25.00            1st

In [31]:
titanic.tail()

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female 14.50            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male 26.50            3rd
1307        Zakarian, Mr. Ortin       no    male 27.00            3rd
1308         Zimmerman, Mr. Leo       no    male 29.00            3rd

In [32]:
titanic.columns = ['name', 'survived', 'sex', 'age', 'class']

titanic.head()

                              name survived     sex   age class
0    Allen, Miss. Elisabeth Walton      yes  female 29.00   1st
1   Allison, Master. Hudson Trevor      yes    male  0.92   1st
2     Allison, Miss. Helen Loraine       no  female  2.00   1st
3  Allison, Mr. Hudson Joshua Crei       no    male 30.00   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female 25.00   1st

In [33]:
titanic.describe()

          age
count 1046.00
mean    29.88
std     14.41
min      0.17
25%     21.00
50%     28.00
75%     39.00
max     80.00

In [34]:
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

In [37]:
!pip install matplotlib
%matplotlib

histogram = titanic.hist()

[notice] A new release of pip available: 22.3.1 -> 23.0
[notice] To update, run: python.exe -m pip install --upgrade pip

Collecting matplotlib
  Downloading matplotlib-3.7.0-cp311-cp311-win_amd64.whl (7.6 MB)
     ---------------------------------------- 7.6/7.6 MB 6.7 MB/s eta 0:00:00
Collecting contourpy>=1.0.1
  Downloading contourpy-1.0.7-cp311-cp311-win_amd64.whl (162 kB)
     -------------------------------------- 163.0/163.0 kB 2.0 MB/s eta 0:00:00
Collecting cycler>=0.10
  Downloading cycler-0.11.0-py3-none-any.whl (6.4 kB)
Collecting fonttools>=4.22.0
  Downloading fonttools-4.38.0-py3-none-any.whl (965 kB)
     -------------------------------------- 965.4/965.4 kB 2.4 MB/s eta 0:00:00
Collecting kiwisolver>=1.0.1
  Downloading kiwisolver-1.4.4-cp311-cp311-win_amd64.whl (55 kB)
     -------------------------------------- 55.4/55.4 kB 480.4 kB/s eta 0:00:00
Requirement already satisfied: numpy>=1.20 in c:\users\kelly\appdata\local\programs\python\python311\lib\site-packages (from matplotlib) (1.24.2)
Requirement already satisfied: packaging>=20.0 in c:\users\kelly\appdata\roaming\python\python311\site-packages (from matplotlib) (23.0)
Collecting pillow>=6.2.0
  Downloading Pillow-9.4.0-cp311-cp311-win_amd64.whl (2.5 MB)
     ---------------------------------------- 2.5/2.5 MB 12.1 MB/s eta 0:00:00
Collecting pyparsing>=2.3.1
  Downloading pyparsing-3.0.9-py3-none-any.whl (98 kB)
     -------------------------------------- 98.3/98.3 kB 704.8 kB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.7 in c:\users\kelly\appdata\roaming\python\python311\site-packages (from matplotlib) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\kelly\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib
Successfully installed contourpy-1.0.7 cycler-0.11.0 fonttools-4.38.0 kiwisolver-1.4.4 matplotlib-3.7.0 pillow-9.4.0 pyparsing-3.0.9
Using matplotlib backend: <object object at 0x0000029BBD486500>

: